/**
@method Seemple.useDOMLibrary
@module seemple/usedomlibrary
@importance 3
@since 0.2
@summary Змушує використовувати певну бібліотеку для роботи з DOM
@desc За замовчуванням, Seemple.js використовує в якості бібліотеки ту, яка знаходиться за посиланням ``window.$``. Якщо такої змінної немає в глобальному просторі імен, або ж вона не включає в себе необхідний набір методів, то використовується вбудована мікро бібліотека.

Метод ``useDOMLibrary`` змушує фреймворк використовувати ту бібліотеку, яку ви захочете використовувати, не дивлячись на відсутність такої в глобальному просторі імен або з іншої причини (наприклад, якщо використовується дві різні версії jQuery на сторінці). Необхідно, щоб метод був запущений перед оголошенням будь-яких байндінгов.

@param {function} $ - Будь-яка бібліотека (jQuery, Zepto, ``null`` для використання вбудованої мікро-бібліотеки)

@example
Seemple.useDOMLibrary(jQuery.noConflict());
*/
