/**
@method Matreshka.Array#rerender
@importance 3
@since 0.3
@summary Перемальовує DOM вузли об'єктів, що входять в масив
@desc Цей метод заново рендерить елементи масиву в контейнері масиву. Якщо вузол, який асоційований з айтемом вже створений, метод, замість перемальовування з нуля, "перевставляє" його в контейнер масиву.

Метод може бути корисним на випадок, коли елементи додані в масив перед оголошенням контейнера.

Щоб змусити масив перемалюватися, незалежно від наявності відрендерених вузлів (наприклад, ви використовуєте кастомний шаблонізатор в ``itemRenderer``), передайте в метод об'єкт з властивістю ``forceRerender`` рівною ``true``.
@param {eventOptions} [eventOptions] - Об'єкт події
@returns {matreshkaArray} self
@example
this.rerender({
	forceRerender: true
});
*/
